Creating Series

In [2]:
import numpy as np
import pandas as pd

In [8]:
labels = ('a','b','c')
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {1:10,2:20,3:30}

Phele hum list sai series ko create karge

In [4]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

Mujeh custom labels layout krna ha

In [5]:
pd.Series(my_list,index = labels)

a    10
b    20
c    30
dtype: int64

Kya mai ek series ko array sai create kr sakti hu

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

Kya mai ek series dictionary sai create kr sakti hu

In [9]:
pd.Series(d)

1    10
2    20
3    30
dtype: int64

DataFrame

In [3]:
import numpy as np
import pandas as pd

Creating a dataframe(in dictionary and list)

Yeh Dataframe dictionary ke helps sai create kiya ha

In [4]:
data = {
     'Name': ['Prachi','Rahul','Yash','Mohan'],
      'Age' : [28,34,29,43],
      'City' : ['New york','Paris','Canada','Franch'],
      'Salary' : [65000,70000,62000,85000]
}
df = pd.DataFrame(data)
df

     Name  Age      City  Salary
0  Prachi   28  New york   65000
1   Rahul   34     Paris   70000
2    Yash   29    Canada   62000
3   Mohan   43    Franch   85000

Yeh dataframe list ki helps sai create kiya ha

In [7]:
data_list = [
        ['Prachi', 28 ,'New york', 65000],
        ['Rahul' ,  34 , 'Paris' , 70000],
        ['Yash'  ,   29 , 'Canada',62000],
        ['Mohan' ,  43 , 'Franch', 85000],
]
df2 = pd.DataFrame(data_list)
columns = ['Name','Age','City','Salary']
df2 = pd.DataFrame(data_list,columns = columns)
df2

     Name  Age      City  Salary
0  Prachi   28  New york   65000
1   Rahul   34     Paris   70000
2    Yash   29    Canada   62000
3   Mohan   43    Franch   85000

Selection and Indexing of Columns

phele mujeh sirf ek column ko select krna ha and show krna ha screen per

In [12]:
df2['Name']

0    Prachi
1     Rahul
2      Yash
3     Mohan
Name: Name, dtype: object

ab mujeh one more columns ko select krna ha and show krna ha screen per

In [13]:
df2[["Name","City"]]

     Name      City
0  Prachi  New york
1   Rahul     Paris
2    Yash    Canada
3   Mohan    Franch

Creating a new column

Mujeh df2 mai ek column add krna ha 'Designation' name ka

In [19]:
df2["Designation"] = ["Data Analytic","Doctor","Web developer","Teacher"]
df2

     Name  Age      City  Salary    Designation
0  Prachi   28  New york   65000  Data Analytic
1   Rahul   34     Paris   70000         Doctor
2    Yash   29    Canada   62000  Web developer
3   Mohan   43    Franch   85000        Teacher

Removing Column

Mujeh ab designation column remove krna h but sirf temporary

In [21]:
df2.drop('Designation',axis = 1)

     Name  Age      City  Salary
0  Prachi   28  New york   65000
1   Rahul   34     Paris   70000
2    Yash   29    Canada   62000
3   Mohan   43    Franch   85000

Ab mujeh designation remove krna h but permanent

In [23]:
df2.drop('Designation', axis = 1 , inplace = True)

In [24]:
df2

     Name  Age      City  Salary
0  Prachi   28  New york   65000
1   Rahul   34     Paris   70000
2    Yash   29    Canada   62000
3   Mohan   43    Franch   85000

Ab mujeh multiple column remove krna ha (City and salary) but temporary

In [25]:
df2.drop(["City","Salary"],axis = 1)

     Name  Age
0  Prachi   28
1   Rahul   34
2    Yash   29
3   Mohan   43

Ab mujeh 0 wali row ko remove karna h

In [26]:
df2.drop(0,axis = 0)

    Name  Age    City  Salary
1  Rahul   34   Paris   70000
2   Yash   29  Canada   62000
3  Mohan   43  Franch   85000

Selectiong Rows

Abhi mujeh sirf ek row select krani ha and show bhi krni ha

In [27]:
df2.loc[0]

Name        Prachi
Age             28
City      New york
Salary       65000
Name: 0, dtype: object

Abhi mujeh sirf multiple row select krni h and show bhi krni h

In [29]:
df2.loc[[0,3]]

     Name  Age      City  Salary
0  Prachi   28  New york   65000
3   Mohan   43    Franch   85000

Mujeh ab index ke basis per select krni h row

In [30]:
df2.iloc[2]

Name        Yash
Age           29
City      Canada
Salary     62000
Name: 2, dtype: object

Selecting subsets of rows and columns

Mujeh df mai sai sirf name and age ka portion chahiye tha rtow 2,3 chahiye thi

In [5]:
df.loc[[2,3]][['Name','Age']]

    Name  Age
2   Yash   29
3  Mohan   43

Conditional Selection

Ab mujeh sirf un people ka name and data chahitye jiski age 30 sai above ha

In [11]:
df2[df2["Age"] > 30]

    Name  Age    City  Salary
1  Rahul   34   Paris   70000
3  Mohan   43  Franch   85000

Ab mujeh sirf un people ka name and data chahiye jiski age 20 above ha and unki city Canada ha

In [13]:
df2[(df2["Age"] > 20) & (df2["City"] == "Canada")]

   Name  Age    City  Salary
2  Yash   29  Canada   62000

Missing Data

In [14]:
import numpy as np
import pandas as pd

Finding missing data

In [31]:
data = {
     'A':[1,2,np.nan,4,5],
     'B':[1,2,3,4,5],
     'C':[1,2,3,np.nan,np.nan],
     'D':[1,np.nan,np.nan,np.nan,5]
}
df = pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

Abhio mujeh sirf check krna ha ki value missing h yeh

In [17]:
df.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

Ab mujeh check krna ha and count krna ha konsai column mai sabsai zyda missing value ha

In [18]:
df.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

Mujeh yeh janana ha h ki kya mere sare column mai missing value h yeh nhi

In [19]:
df.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

Removing Missing data

In [26]:
df

   A    B    C    D
0  1  NaN  1.0  1.0
1  2  2.0  2.0  NaN
2  3  3.0  3.0  NaN
3  4  4.0  NaN  NaN
4  5  5.0  NaN  5.0

Abhi mujeh woh row show krni h sirf jismai ek bhi missing value nhi ho

In [32]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

Mujeh yhe janana h ki sirf unhi rows ko rakhna h jismai kam sai kam non missing value ho ho (NaN ke alwa )

In [ ]:
df.dropna(thresh = 3)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

Filling the missing data

Ab mai jaha - jaha NaN value ha mai waha 0 fill krna h mujeh

In [37]:
df.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

Ab mujeh alag - alag column mai different value deni ha

In [39]:
values = {'A':0 , 'B':100 , 'C':400 , 'D':300}
df.fillna(value=values)

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  300.0
2  0.0  3    3.0  300.0
3  4.0  4  400.0  300.0
4  5.0  5  400.0    5.0

Merging,Joining ,Concatenation

In [1]:
import numpy as np
import pandas as pd

Merging 2 Dataframes

Phele hum 2 dataframe banage

In [3]:

employees = pd.DataFrame({
      'employee_id':[1,2,3,4,5],
      'name':['Prachi','Yash','Rohit','Sohan','Mohan'],
      'department':['IT','HR','Finace','IT','HR']    
})


Salaries = pd.DataFrame({
     'employee_id': [1,2,3,6,7],
     'salary':[60000,80000,65000,70000,90000],
     'bonus':[5000,10000,7000,8000,12000]

    

    
})

In [4]:
employees

   employee_id    name department
0            1  Prachi         IT
1            2    Yash         HR
2            3   Rohit     Finace
3            4   Sohan         IT
4            5   Mohan         HR

In [6]:
Salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

Abhi mujeh employees and Salaries wale dataframe ko ek krna ha and mujeh sirf wahi row chahiye jo mere employee_id mai common row ho

In [9]:
pd.merge(employees,Salaries,on = 'employee_id', how = 'inner')

   employee_id    name department  salary  bonus
0            1  Prachi         IT   60000   5000
1            2    Yash         HR   80000  10000
2            3   Rohit     Finace   65000   7000

Ab mujeh sare record chahiye screen per chahe match ho yeh nhi ho and missing value fill kre NaN sai

In [10]:
pd.merge(employees,Salaries,on = 'employee_id', how = 'outer')

   employee_id    name department   salary    bonus
0            1  Prachi         IT  60000.0   5000.0
1            2    Yash         HR  80000.0  10000.0
2            3   Rohit     Finace  65000.0   7000.0
3            4   Sohan         IT      NaN      NaN
4            5   Mohan         HR      NaN      NaN
5            6     NaN        NaN  70000.0   8000.0
6            7     NaN        NaN  90000.0  12000.0

Kaunse employees ke salary records available hain, aur kaunse missing hain

In [11]:
pd.merge(employees,Salaries,on = 'employee_id', how = 'left')

   employee_id    name department   salary    bonus
0            1  Prachi         IT  60000.0   5000.0
1            2    Yash         HR  80000.0  10000.0
2            3   Rohit     Finace  65000.0   7000.0
3            4   Sohan         IT      NaN      NaN
4            5   Mohan         HR      NaN      NaN

Ab humko pta krna h kaunsai employee ka salary record available ha and kaunsai salary records ka employee data missing ha

In [12]:
pd.merge(employees,Salaries,on = 'employee_id', how = 'right')

   employee_id    name department  salary  bonus
0            1  Prachi         IT   60000   5000
1            2    Yash         HR   80000  10000
2            3   Rohit     Finace   65000   7000
3            6     NaN        NaN   70000   8000
4            7     NaN        NaN   90000  12000

2 concatination of dataframe

phele hum 2 dataframe create krege

In [13]:
df1 = pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2'],
    'C':['C0','C1','C2']    
})


df2 = pd.DataFrame({
   'A':['A3','A4','A5'],
   'B':['B3','B4','B5'],
   'C':['C3','C4','C5']

    
})

Mujeh df1 and df2 ko concat krna ha and rows ke niche rows add krna ha

In [15]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

Mujeh df1 and df2 ko concat krna ha and column ke side mai columns add krna ha

In [16]:
pd.concat([df1,df2],axis = 1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

Joining of 2 Dataframe

phele hum 2 dataframe ko create krege

In [18]:
df1 = pd.DataFrame({
    'name':['Alice','Bob','Charlie']
},index = [1,2,3])

df2 = pd.DataFrame({
    'score':[85,90,75]
},index = [2,3,4])

In [19]:
df1

      name
1    Alice
2      Bob
3  Charlie

In [20]:
df2

   score
2     85
3     90
4     75

Phele mujeh yeh krna ha ki df1 ke column phele aaye and df2 jke column baad mai aaye

In [21]:
df1.join(df2)

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0

Ab mujeh phele df2 ke column phele aaye and df1 ke baad mai aaye

In [22]:
df2.join(df1)

   score     name
2     85      Bob
3     90  Charlie
4     75      NaN

Abhi mujeh sare record screen par chahiye and missing value fill ho jaye NaN sai

In [23]:
df1.join(df2,how = 'outer')

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

Group By

In [1]:
import numpy as np
import pandas as pd

Phele hum ek dataframe create karege

In [3]:
data = {
    'Category':['A','B','A','B','A','B','A','B'],
    'Store':['S1','S1','S2','S2','S1','S2','S2','S1'],
    'Sales':[100,200,150,250,120,180,200,300],
    'Quantity':[10,15,12,18,8,20,15,25],
    'Date':pd.date_range('2023-01-01',periods = 8)   
}
df = pd.DataFrame(data)
df

  Category Store  Sales  Quantity       Date
0        A    S1    100        10 2023-01-01
1        B    S1    200        15 2023-01-02
2        A    S2    150        12 2023-01-03
3        B    S2    250        18 2023-01-04
4        A    S1    120         8 2023-01-05
5        B    S2    180        20 2023-01-06
6        A    S2    200        15 2023-01-07
7        B    S1    300        25 2023-01-08

Mujeh group by krna h category ko and calculate the sum of Sales.

In [8]:
d = df.groupby('Category')['Sales'].sum()
d

Category
A    570
B    930
Name: Sales, dtype: int64

Mujeh group by krna h Store ko and calculate the sum of Sales.

In [7]:
d = df.groupby('Store')['Sales'].sum()
d

Store
S1    720
S2    780
Name: Sales, dtype: int64

mujeh multiple column ko group by krna ha like example mujeh Category and Store ko group by krna ha and calcuate the sum of Sales.

In [10]:
d = df.groupby(['Category','Store'])['Sales'].sum()
d

Category  Store
A         S1       220
          S2       350
B         S1       500
          S2       430
Name: Sales, dtype: int64

Aggregation

mujeh sales ka mean nikalna ha ha sirf

In [11]:
df['Sales'].mean()

np.float64(187.5)

Ab mujeh sales per he sare function use krnai ha jaise mean','median', 'count', 'max','min','sum','std'

In [15]:
df['Sales'].agg(['mean','median', 'count', 'max','min','sum','std'])

mean       187.500000
median     190.000000
count        8.000000
max        300.000000
min        100.000000
sum       1500.000000
std         66.062741
Name: Sales, dtype: float64

Pivot Table

In [6]:
import numpy as np
import pandas as pd

Phele hum ek dataframe create krege

In [11]:
data = {
    'Date':pd.date_range('2023-01-01',periods = 20),
    'Product':['A','B','C','D'] * 5,
    'Region':['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 
              'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North','South'],
    'Sales':np.random.randint(100,1000,20),
    'Units':np.random.randint(10,100,20),
    'Rep':['John','Mary','Bob','Alice','John','Mary','Bob','Alice','John','Mary',
           'Bob','Alice','John','Mary','Bob','Alice','John','Mary','Bob','Alice']
    
}
df = pd.DataFrame(data)

df['Month']= df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    250     37   John  January      Q1
1  2023-01-02       B   West    216     35   Mary  January      Q1
2  2023-01-03       C  North    477     94    Bob  January      Q1
3  2023-01-04       D  South    603     20  Alice  January      Q1
4  2023-01-05       A   East    816     16   John  January      Q1
5  2023-01-06       B   West    684     21   Mary  January      Q1
6  2023-01-07       C  North    217     68    Bob  January      Q1
7  2023-01-08       D  South    516     12  Alice  January      Q1
8  2023-01-09       A   East    387     21   John  January      Q1
9  2023-01-10       B   West    458     45   Mary  January      Q1
10 2023-01-11       C  North    735     25    Bob  January      Q1
11 2023-01-12       D  South    378     16  Alice  January      Q1
12 2023-01-13       A   East    967     62   John  January      Q1
13 2023-01-14       B   West    754     49   Mary  January      Q1
14 2023-01-15       C  North    343     79    Bob  January      Q1
15 2023-01-16       D  South    538     50  Alice  January      Q1
16 2023-01-17       A   East    939     67   John  January      Q1
17 2023-01-18       B   West    667     91   Mary  January      Q1
18 2023-01-19       C  North    620     31    Bob  January      Q1
19 2023-01-20       D  South    476     36  Alice  January      Q1

Mujeh product and region ke hisab sai sales dekhnai ha and mean bhi nikalna ha Sales ka

In [14]:
pivot1 = pd.pivot_table(df,values = "Sales",index = 'Region',columns = "Product",aggfunc = 'mean')
pivot1

Product      A      B      C      D
Region
East     671.8    NaN    NaN    NaN
North      NaN    NaN  478.4    NaN
South      NaN    NaN    NaN  502.2
West       NaN  555.8    NaN    NaN

mujeh product and region ke hissab sai units and sales ka average dekhna ha

In [16]:
pivot2 = pd.pivot_table(df,values = ["Sales","Units"],index = 'Region',columns = "Product",aggfunc = 'mean')
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     671.8    NaN    NaN    NaN  40.6   NaN   NaN   NaN
North      NaN    NaN  478.4    NaN   NaN   NaN  59.4   NaN
South      NaN    NaN    NaN  502.2   NaN   NaN   NaN  26.8
West       NaN  555.8    NaN    NaN   NaN  48.2   NaN   NaN

Cross tabs

Mujeh yeh dekna ha ki region ke hissab sai konsa product kitni bar aaya ha

In [17]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

Operation

In [5]:
import numpy as np
import pandas as pd

phele hum ek dataframe create karege basic operation ke leye

DataFrame Basic Operation

In [6]:
df1 = pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[10,20,30,40,50],
    'C':[100,200,300,400,500]
    
})
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

mujeh pta krna h mere df1 mai kitni row and  column ha

In [6]:
df1.shape

(5, 3)

mujeh pta krna ha konsai column ha mere df1 mai

In [7]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

mujeh yeh pta krna ha mere dataframe mai df1 mai index dtype,columns,non - null values wagera kitni ha

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

mujeh yeh pta krna ha mere dataframe df1 mai kya mai statistical describe kr sakti hu columns mai

In [11]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

kya  mai kisi ek column mai kuch add kr sakti hu broadcasting ka use krke jaise mujeh 'A' column mai 10 ki add krna ha

In [12]:
df1['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

DataFrames Applying Functions

In [7]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

mujeh yeh krna ha 'B' column ka jo value ha usko square mai krna ha but mujeh yhe bhi krna ha mere main dataframe mai apply ho

In [12]:
def square(x):
    return x**2

In [13]:
df1['D'] = df1["B"].apply(square)

In [14]:
df1

   A   B    C     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500